In [5]:
import pandas as pd
import numpy as np

In [6]:
data = np.random.rand(4,3)

In [7]:
data

array([[0.94875947, 0.14377651, 0.56856503],
       [0.03524917, 0.49806596, 0.18180493],
       [0.27079776, 0.18084472, 0.11797624],
       [0.51405747, 0.35459012, 0.16067846]])

In [10]:
dataFrame = pd.DataFrame(data)

In [11]:
dataFrame

          0         1         2
0  0.948759  0.143777  0.568565
1  0.035249  0.498066  0.181805
2  0.270798  0.180845  0.117976
3  0.514057  0.354590  0.160678

In [12]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zaynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [13]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.948759  0.143777       0.568565
Zaynep  0.035249  0.498066       0.181805
Atlas   0.270798  0.180845       0.117976
Mehmet  0.514057  0.354590       0.160678

In [14]:
yeniDataFrame["Yas"]

Atil      0.143777
Zaynep    0.498066
Atlas     0.180845
Mehmet    0.354590
Name: Yas, dtype: float64

In [15]:
yeniDataFrame["Maas"]

Atil      0.948759
Zaynep    0.035249
Atlas     0.270798
Mehmet    0.514057
Name: Maas, dtype: float64

In [16]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.948759  0.143777
Zaynep  0.035249  0.498066
Atlas   0.270798  0.180845
Mehmet  0.514057  0.354590

In [17]:
yeniDataFrame.loc["Atil"] #locate kısaltması dedi

Maas             0.948759
Yas              0.143777
Calisma Saati    0.568565
Name: Atil, dtype: float64

In [18]:
yeniDataFrame.iloc[1]

Maas             0.035249
Yas              0.498066
Calisma Saati    0.181805
Name: Zaynep, dtype: float64

In [19]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [20]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.948759  0.143777       0.568565        0.287553
Zaynep  0.035249  0.498066       0.181805        0.996132
Atlas   0.270798  0.180845       0.117976        0.361689
Mehmet  0.514057  0.354590       0.160678        0.709180

In [21]:
yeniDataFrame.drop("Maas",axis=1)

             Yas  Calisma Saati  Emeklilik Yasi
Atil    0.143777       0.568565        0.287553
Zaynep  0.498066       0.181805        0.996132
Atlas   0.180845       0.117976        0.361689
Mehmet  0.354590       0.160678        0.709180

In [22]:
yeniDataFrame.drop("Mehmet",axis=0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.948759  0.143777       0.568565        0.287553
Zaynep  0.035249  0.498066       0.181805        0.996132
Atlas   0.270798  0.180845       0.117976        0.361689

In [23]:
yeniDataFrame # inplace option yazılmazsa gerçek değişiklik yapmıyor

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.948759  0.143777       0.568565        0.287553
Zaynep  0.035249  0.498066       0.181805        0.996132
Atlas   0.270798  0.180845       0.117976        0.361689
Mehmet  0.514057  0.354590       0.160678        0.709180

In [24]:
yeniDataFrame.drop("Mehmet",axis=0,inplace=True)

In [25]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.948759  0.143777       0.568565        0.287553
Zaynep  0.035249  0.498066       0.181805        0.996132
Atlas   0.270798  0.180845       0.117976        0.361689

In [26]:
yeniDataFrame.loc["Atil"]["Yas"]

np.float64(0.14377651032871475)

In [27]:
yeniDataFrame.loc["Atil","Yas"]

np.float64(0.14377651032871475)

In [28]:
yeniDataFrame < 0

         Maas    Yas  Calisma Saati  Emeklilik Yasi
Atil    False  False          False           False
Zaynep  False  False          False           False
Atlas   False  False          False           False

In [29]:
booleanFrame = yeniDataFrame < 0

In [30]:
yeniDataFrame[booleanFrame]

        Maas  Yas  Calisma Saati  Emeklilik Yasi
Atil     NaN  NaN            NaN             NaN
Zaynep   NaN  NaN            NaN             NaN
Atlas    NaN  NaN            NaN             NaN

In [32]:
yeniDataFrame[yeniDataFrame["Yas"] > 0] # Yas kolonunda bana sadece 0 dan büyük olanları getir dedik

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.948759  0.143777       0.568565        0.287553
Zaynep  0.035249  0.498066       0.181805        0.996132
Atlas   0.270798  0.180845       0.117976        0.361689

In [33]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati  Emeklilik Yasi
0    Atil  0.948759  0.143777       0.568565        0.287553
1  Zaynep  0.035249  0.498066       0.181805        0.996132
2   Atlas  0.270798  0.180845       0.117976        0.361689

In [34]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.948759  0.143777       0.568565        0.287553
Zaynep  0.035249  0.498066       0.181805        0.996132
Atlas   0.270798  0.180845       0.117976        0.361689

In [39]:
yeniIndexListesi= ["Ati","Zey","Atl"]

In [40]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

In [41]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi Yeni Indeks
Atil    0.948759  0.143777       0.568565        0.287553         Ati
Zaynep  0.035249  0.498066       0.181805        0.996132         Zey
Atlas   0.270798  0.180845       0.117976        0.361689         Atl

In [43]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati  Emeklilik Yasi
Yeni Indeks
Ati          0.948759  0.143777       0.568565        0.287553
Zey          0.035249  0.498066       0.181805        0.996132
Atl          0.270798  0.180845       0.117976        0.361689

In [44]:
yeniDataFrame.set_index("Yeni Indeks",inplace = True)

In [45]:
yeniDataFrame

                 Maas       Yas  Calisma Saati  Emeklilik Yasi
Yeni Indeks
Ati          0.948759  0.143777       0.568565        0.287553
Zey          0.035249  0.498066       0.181805        0.996132
Atl          0.270798  0.180845       0.117976        0.361689

In [46]:
yeniDataFrame.loc["Ati"]

Maas              0.948759
Yas               0.143777
Calisma Saati     0.568565
Emeklilik Yasi    0.287553
Name: Ati, dtype: float64

## MultiIndeks

In [47]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [48]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [49]:
birlesmisIndeks = list(zip(ilkIndexler,icIndeksler))

In [50]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [51]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [52]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [53]:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [54]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [55]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [56]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [57]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [58]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [59]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [60]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [61]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F